# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

word = input('Enter your word: ')
combination = input('What do you want find: ')
print(word.count(combination))